Seph-esp/ESP32DIV-v2-Bruce/src/modules/NRF24/nrf_jammer.cpp
/**
 * @file nrf_jammer.cpp
 * @brief Enhanced 2.4 GHz jammer with 12 modes and dual strategy.
 *
 * Features over original:
 *  - 12 jamming mode presets with tuned channel lists
 *  - Data flooding via writeFast() for packet collision attacks
 *  - Constant carrier (CW) for FHSS disruption
 *  - Per-mode configurable PA, data rate, dwell time
 *  - Config persistence via LittleFS
 *  - Random hopping for FHSS targets (BT, Drone)
 *  - Live mode/channel switching during operation
 *  - Improved UI with adaptive layout
 *  - UART support preserved for external NRF modules
 *
 * Hardware: E01-ML01SP2 (NRF24L01+ PA+LNA, +20dBm effective).
 */

#include "nrf_jammer.h"
#include "core/display.h"
#include "core/mykeyboard.h"
#include <LittleFS.h>
#include <globals.h>

// ── Garbage payload for data flooding ───────────────────────────
// 32 bytes maximises TX duty cycle per burst at 2Mbps
static const uint8_t JAM_FLOOD_DATA[32] = {0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA, 0xDE, 0xAD, 0xBE,
                                           0xEF, 0xCA, 0xFE, 0xBA, 0xBE, 0xFF, 0x00, 0xFF, 0x00, 0xA5, 0x5A,
                                           0xA5, 0x5A, 0x01, 0x23, 0x45, 0x67, 0x89, 0xAB, 0xCD, 0xEF};

// ── Config persistence ──────────────────────────────────────────
static const char *NRF_JAM_CFG_PATH = "/nrf_jam_cfg.bin";
#define NRF_JAM_CFG_VERSION 4

// ── Per-mode default configs ────────────────────────────────────
// Tuned for E01-ML01SP2 (PA+LNA): PA=3 → chip 0dBm → ~+20dBm at antenna
//
// Strategy rationale:
//   Flooding (1): packet collisions + CRC corruption. Best for
//     channel-specific protocols (WiFi, BLE, Zigbee)
//   CW (0): saturates receiver AGC, disrupts PLL lock. Best for
//     FHSS targets (BT classic, Drone, RC) and analog links (video)
//
// Default: CW (constant carrier) for all modes — proven reliable
// like the original jammer. Users can switch to Flooding via config menu.
//
// CW: unmodulated carrier saturates receiver AGC → proven & fast
// Flooding: packet collisions via writeFast → optional, enable in config
//
//                                        PA  DR  dwell strat burst rand _res
static NrfJamConfig jamConfigs[NRF_JAM_MODE_COUNT] = {
    /* FULL       */ {3, 1, 0, 2, 20, 1, 0}, // Turbo flood, max burst, random
    /* WIFI       */ {3, 1, 0, 2, 20, 0, 0}, // Turbo flood WiFi channels
    /* BLE        */ {3, 1, 0, 2, 20, 1, 0}, // Turbo flood, random hop
    /* BLE_ADV    */ {3, 1, 0, 2, 20, 0, 0}, // Turbo flood adv channels
    /* BLUETOOTH  */ {3, 1, 0, 2, 20, 1, 0}, // Turbo flood + random (FHSS)
    /* USB        */ {3, 1, 0, 2, 20, 1, 0}, // Turbo flood + random
    /* VIDEO      */ {3, 1, 0, 2, 20, 0, 0}, // Turbo flood video band
    /* RC         */ {3, 1, 0, 2, 20, 1, 0}, // Turbo flood + random (FHSS)
    /* ZIGBEE     */ {3, 1, 0, 2, 20, 1, 0}, // Turbo flood + random
    /* DRONE      */ {3, 1, 0, 2, 20, 1, 0}, // Turbo flood + random (FHSS)
};

// ── Mode information table ──────────────────────────────────────
static const NrfJamModeInfo MODE_INFO[NRF_JAM_MODE_COUNT] = {
    {"Full Spectrum",   "Full Spec" },
    {"WiFi 2.4GHz",     "WiFi 2.4"  },
    {"BLE Data",        "BLE Data"  },
    {"BLE Advertising", "BLE Adv"   },
    {"BT Classic",      "BT Classic"},
    {"USB Dongles",     "USB Dongle"},
    {"Video/FPV",       "Video FPV" },
    {"RC Controllers",  "RC Ctrl"   },
    {"Zigbee",          "Zigbee"    },
    {"Drone FHSS",      "Drone"     },
};

// ── Channel lists ───────────────────────────────────────────────

// WiFi ch 1,6,11: each spans 22MHz, sub-channels cover bandwidth
static const uint8_t CH_WIFI[] = {
    1,  3,  5,  7,  9,  11, 13, 15, 17, 19, 21, 23, // WiFi ch 1
    26, 28, 30, 32, 34, 36, 38, 40, 42,             // WiFi ch 6
    51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73  // WiFi ch 11
};

// BLE data channels: nRF24 ch 2-80 (even numbers cover BLE ch 0-36)
static const uint8_t CH_BLE[] = {2,  4,  6,  8,  10, 12, 14, 16, 18, 20, 22, 24, 26, 28,
                                 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56,
                                 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80};

// BLE advertising: ch37=2402→nRF ch2, ch38=2426→nRF ch26, ch39=2480→nRF ch80
static const uint8_t CH_BLE_ADV[] = {2, 26, 80};

// Classic Bluetooth: all FHSS channels 2-80 (matches original jammer)
static const uint8_t CH_BLUETOOTH[] = {2,  3,  4,  5,  6,  7,  8,  9,  10, 11, 12, 13, 14, 15, 16, 17,
                                       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
                                       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49,
                                       50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65,
                                       66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80};

// USB wireless dongles: expanded range covering common dongle frequencies
static const uint8_t CH_USB[] = {
    32, 34, 36, 38, 40, 42, 44, 46, 48, 50,
    52, 54, 56, 58, 60, 62, 64, 66, 68, 70
};

// Video streaming: expanded FPV + baby monitor range (upper ISM band)
static const uint8_t CH_VIDEO[] = {
    60, 62, 64, 66, 68, 70, 72, 74, 76, 78,
    80, 82, 84, 86, 88, 90, 92, 94, 96, 98,
    100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124
};

// RC controllers: expanded to cover main RC frequency allocations
static const uint8_t CH_RC[] = {
    1, 3, 5, 7, 9, 11, 13, 15, 17, 19,
    21, 23, 25, 27, 29, 31, 33, 35, 37, 39
};

// Zigbee ch 11-26: 3 nRF sub-channels per Zigbee channel (±1MHz)
static const uint8_t CH_ZIGBEE[] = {
    4,  5,  6,  // ch11
    9,  10, 11, // ch12
    14, 15, 16, // ch13
    19, 20, 21, // ch14
    24, 25, 26, // ch15
    29, 30, 31, // ch16
    34, 35, 36, // ch17
    39, 40, 41, // ch18
    44, 45, 46, // ch19
    49, 50, 51, // ch20
    54, 55, 56, // ch21
    59, 60, 61, // ch22
    64, 65, 66, // ch23
    69, 70, 71, // ch24
    74, 75, 76, // ch25
    79, 80, 81  // ch26
};

// ── Channel list accessor ───────────────────────────────────────
static const uint8_t *getChannelList(NrfJamMode mode, size_t &count) {
    switch (mode) {
        case NRF_JAM_WIFI: count = sizeof(CH_WIFI); return CH_WIFI;
        case NRF_JAM_BLE: count = sizeof(CH_BLE); return CH_BLE;
        case NRF_JAM_BLE_ADV: count = sizeof(CH_BLE_ADV); return CH_BLE_ADV;
        case NRF_JAM_BLUETOOTH: count = sizeof(CH_BLUETOOTH); return CH_BLUETOOTH;
        case NRF_JAM_USB: count = sizeof(CH_USB); return CH_USB;
        case NRF_JAM_VIDEO: count = sizeof(CH_VIDEO); return CH_VIDEO;
        case NRF_JAM_RC: count = sizeof(CH_RC); return CH_RC;
        case NRF_JAM_ZIGBEE: count = sizeof(CH_ZIGBEE); return CH_ZIGBEE;
        case NRF_JAM_DRONE: count = 0; return nullptr; // Random hop
        default: count = 0; return nullptr;
    }
}

// ── Config persistence ──────────────────────────────────────────
static void loadJamConfigs() {
    if (!LittleFS.exists(NRF_JAM_CFG_PATH)) return;

    File f = LittleFS.open(NRF_JAM_CFG_PATH, "r");
    if (!f) return;

