Seph-esp/ESP32DIV-v2-Bruce/src/modules/NRF24/nrf_jammer.cpp
    uint8_t version = f.read();
    if (version != NRF_JAM_CFG_VERSION) {
        f.close();
        return;
    }

    size_t expected = sizeof(NrfJamConfig) * NRF_JAM_MODE_COUNT;
    size_t bytesRead = f.read((uint8_t *)jamConfigs, expected);
    f.close();

    if (bytesRead != expected) return;

    // Clamp values
    for (int i = 0; i < NRF_JAM_MODE_COUNT; i++) {
        if (jamConfigs[i].paLevel > 3) jamConfigs[i].paLevel = 3;
        if (jamConfigs[i].dataRate > 2) jamConfigs[i].dataRate = 1;
        if (jamConfigs[i].dwellTimeMs > 200) jamConfigs[i].dwellTimeMs = 200;
        if (jamConfigs[i].strategy > 2) jamConfigs[i].strategy = 0;
        if (jamConfigs[i].burstCount < 1 || jamConfigs[i].burstCount > 20) jamConfigs[i].burstCount = 6;
        if (jamConfigs[i].randomHop > 1) jamConfigs[i].randomHop = 0;
    }
    Serial.println("[JAM] Configs loaded from flash");
}

static void saveJamConfigs() {
    File f = LittleFS.open(NRF_JAM_CFG_PATH, FILE_WRITE);
    if (!f) return;
    f.write(NRF_JAM_CFG_VERSION);
    f.write((uint8_t *)jamConfigs, sizeof(NrfJamConfig) * NRF_JAM_MODE_COUNT);
    f.close();
    Serial.println("[JAM] Configs saved to flash");
}

// ── Apply RF config to hardware ─────────────────────────────────
static void applyJamConfig(const NrfJamConfig &cfg, bool flooding) {
    rf24_pa_dbm_e paLevels[] = {RF24_PA_MIN, RF24_PA_LOW, RF24_PA_HIGH, RF24_PA_MAX};
    rf24_datarate_e dataRates[] = {RF24_1MBPS, RF24_2MBPS, RF24_250KBPS};

    auto configureRadio = [&](RF24 &radio) {
        radio.setPALevel(paLevels[cfg.paLevel & 3]);
        if (!radio.setDataRate(dataRates[cfg.dataRate <= 2 ? cfg.dataRate : 1])) {
            Serial.println("[JAM] Warning: setDataRate failed");
        }
        radio.setAutoAck(false);
        radio.setRetries(0, 0);
        radio.disableCRC();
        if (flooding) {
            radio.setPayloadSize(32);
            radio.setAddressWidth(3);
            uint8_t txAddr[] = {0xE7, 0xE7, 0xE7};
            radio.openWritingPipe(txAddr);
            radio.stopListening();
        }
    };

    if (nrf1_online) configureRadio(NRFradio);
    if (nrf2_online) configureRadio(NRFradio2);
    if (nrf3_online) configureRadio(NRFradio3);
}

// ── Data flooding on a channel ──────────────────────────────────
// Safely switch channel (CE LOW → configure → CE HIGH) then burst.
static void floodChannel(uint8_t ch, uint16_t dwellMs, uint8_t burstCount) {
    // 1. CE LOW to change channel
    if (nrf1_online) {
        digitalWrite(bruceConfigPins.NRF24_bus.io0, LOW);
        NRFradio.flush_tx();
        NRFradio.setChannel(ch);
    }
    if (nrf2_online) {
        digitalWrite(47, LOW);
        NRFradio2.flush_tx();
        NRFradio2.setChannel(ch);
    }
    if (nrf3_online) {
        digitalWrite(14, LOW);
        NRFradio3.flush_tx();
        NRFradio3.setChannel(ch);
    }

    // 2. CE HIGH to start transmission
    if (nrf1_online) digitalWrite(bruceConfigPins.NRF24_bus.io0, HIGH);
    if (nrf2_online) digitalWrite(47, HIGH);
    if (nrf3_online) digitalWrite(14, HIGH);

    if (dwellMs == 0) {
        // Turbo: fill FIFO for maximum duty cycle
        for (int i = 0; i < burstCount; i++) {
            if (nrf1_online && !NRFradio.writeFast(JAM_FLOOD_DATA, 32, true)) {
                NRFradio.flush_tx();
            }
            if (nrf2_online && !NRFradio2.writeFast(JAM_FLOOD_DATA, 32, true)) {
                NRFradio2.flush_tx();
            }
            if (nrf3_online && !NRFradio3.writeFast(JAM_FLOOD_DATA, 32, true)) {
                NRFradio3.flush_tx();
            }
        }
        delayMicroseconds(200);
        if (nrf1_online) digitalWrite(bruceConfigPins.NRF24_bus.io0, LOW);
        if (nrf2_online) digitalWrite(47, LOW);
        if (nrf3_online) digitalWrite(14, LOW);
        return;
    }

    unsigned long startMs = millis();
    while ((millis() - startMs) < dwellMs) {
        for (int i = 0; i < burstCount && (millis() - startMs) < dwellMs; i++) {
            if (nrf1_online && !NRFradio.writeFast(JAM_FLOOD_DATA, 32, true)) {
                NRFradio.flush_tx();
            }
            if (nrf2_online && !NRFradio2.writeFast(JAM_FLOOD_DATA, 32, true)) {
                NRFradio2.flush_tx();
            }
            if (nrf3_online && !NRFradio3.writeFast(JAM_FLOOD_DATA, 32, true)) {
                NRFradio3.flush_tx();
            }
            delayMicroseconds(3);
        }
    }
    if (nrf1_online) digitalWrite(bruceConfigPins.NRF24_bus.io0, LOW);
    if (nrf2_online) digitalWrite(47, LOW);
    if (nrf3_online) digitalWrite(14, LOW);
}

static void turboFloodChannel(uint8_t ch, uint8_t burstCount) {
    static uint8_t xorSeed = 0xA5;

    // 1. CE LOW to configure channel
    if (nrf1_online) {
        digitalWrite(bruceConfigPins.NRF24_bus.io0, LOW);
        NRFradio.flush_tx();
        NRFradio.setChannel(ch);
    }
    if (nrf2_online) {
        digitalWrite(47, LOW);
        NRFradio2.flush_tx();
        NRFradio2.setChannel(ch);
    }
    if (nrf3_online) {
        digitalWrite(14, LOW);
        NRFradio3.flush_tx();
        NRFradio3.setChannel(ch);
    }

    // 2. CE HIGH to start transmission
    if (nrf1_online) digitalWrite(bruceConfigPins.NRF24_bus.io0, HIGH);
    if (nrf2_online) digitalWrite(47, HIGH);
    if (nrf3_online) digitalWrite(14, HIGH);

    // Phase 1: Standard burst with XOR-varied payload
    uint8_t data[32];
    for (int i = 0; i < 32; i++) {
        xorSeed ^= (xorSeed << 5);
        xorSeed ^= (xorSeed >> 3);
        data[i] = JAM_FLOOD_DATA[i] ^ xorSeed;
    }
    for (int i = 0; i < burstCount; i++) {
        if (nrf1_online && !NRFradio.writeFast(data, 32, true)) NRFradio.flush_tx();
        if (nrf2_online && !NRFradio2.writeFast(data, 32, true)) NRFradio2.flush_tx();
        if (nrf3_online && !NRFradio3.writeFast(data, 32, true)) NRFradio3.flush_tx();
    }

    // Phase 2: All-ones payload (max RF energy per bit at 2Mbps)
    memset(data, 0xFF, 32);
    for (int i = 0; i < burstCount; i++) {
        if (nrf1_online && !NRFradio.writeFast(data, 32, true)) NRFradio.flush_tx();
        if (nrf2_online && !NRFradio2.writeFast(data, 32, true)) NRFradio2.flush_tx();
        if (nrf3_online && !NRFradio3.writeFast(data, 32, true)) NRFradio3.flush_tx();
    }

    // Phase 3: Alternating 0x55/0xAA for maximum bit transitions
    for (int i = 0; i < 32; i++) data[i] = (i & 1) ? 0xAA : 0x55;
    for (int i = 0; i < burstCount; i++) {
        if (nrf1_online && !NRFradio.writeFast(data, 32, true)) NRFradio.flush_tx();
        if (nrf2_online && !NRFradio2.writeFast(data, 32, true)) NRFradio2.flush_tx();
        if (nrf3_online && !NRFradio3.writeFast(data, 32, true)) NRFradio3.flush_tx();
    }

