Seph-esp/ESP32DIV-v2-Bruce/src/modules/NRF24/nrf_jammer.cpp
    delayMicroseconds(200);
    if (nrf1_online) digitalWrite(bruceConfigPins.NRF24_bus.io0, LOW);
    if (nrf2_online) digitalWrite(47, LOW);
    if (nrf3_online) digitalWrite(14, LOW);
}

// ── Fisher-Yates shuffle for random channel hopping ─────────────
static void shuffleChannels(uint8_t *arr, size_t count) {
    for (size_t i = count - 1; i > 0; i--) {
        size_t j = esp_random() % (i + 1);
        uint8_t tmp = arr[i];
        arr[i] = arr[j];
        arr[j] = tmp;
    }
}

// ── CW initialization helper ────────────────────────────────────
// Must call powerUp() before startConstCarrier() because
// stopConstCarrier() → powerDown() clears the internal PWR_UP flag,
// and startConstCarrier() never restores it (RF24 library bug).
static void initCW(int channel) {
    auto setupCW = [&](RF24 &radio) {
        radio.powerUp();
        delay(5); // Tpd2stby: power-down → standby settle
        radio.setPALevel(RF24_PA_MAX);
        radio.startConstCarrier(RF24_PA_MAX, channel);
        radio.setAddressWidth(5);
        radio.setPayloadSize(2);
        radio.setDataRate(RF24_2MBPS);
    };

    if (nrf1_online) setupCW(NRFradio);
    if (nrf2_online) setupCW(NRFradio2);
    if (nrf3_online) setupCW(NRFradio3);
}

// ── CW on a channel ─────────────────────────────────────────────
// Carrier stays on — just move the frequency via setChannel().
// This matches the original jammer behavior: startConstCarrier once at
// init, then setChannel() to hop.  PLL re-locks in ~130µs, carrier
// is never fully off → maximum duty cycle.
static void cwChannel(uint8_t ch, uint16_t dwellMs) {
    if (nrf1_online) NRFradio.setChannel(ch);
    if (nrf2_online) NRFradio2.setChannel(ch);
    if (nrf3_online) NRFradio3.setChannel(ch);

    if (dwellMs == 0) return;

    if (dwellMs <= 5) {
        delayMicroseconds((uint32_t)dwellMs * 1000);
    } else {
        delay(dwellMs);
    }
}

// ══════════════════════════════════════════════════════════════════
// ═══════════════ CONFIG EDIT UI ═══════════════════════════════
// ══════════════════════════════════════════════════════════════════

static void editModeConfig(NrfJamMode mode) {
    NrfJamConfig &cfg = jamConfigs[(uint8_t)mode];
    const char *paLabels[] = {"MIN (-18dBm)", "LOW (-12dBm)", "HIGH (-6dBm)", "MAX (0/+20dBm)"};
    const char *drLabels[] = {"1 Mbps", "2 Mbps", "250 Kbps"};
    const char *stratLabels[] = {"Constant Carrier", "Data Flooding", "Turbo Flood"};
    const char *hopLabels[] = {"Sequential", "Random"};

    int menuIdx = 0;
    bool editing = false;
    bool redraw = true;
    const int ITEM_COUNT = 7;

    while (true) {
        if (check(EscPress)) {
            saveJamConfigs();
            break;
        }

        if (redraw) {
            drawMainBorderWithTitle(MODE_INFO[(uint8_t)mode].shortName);
            tft.setTextSize(FP);
            tft.setTextColor(bruceConfig.priColor, bruceConfig.bgColor);

            int y = BORDER_PAD_Y + FM * LH + 4;
            int lineH = max(12, tftHeight / (ITEM_COUNT + 3));

            const char *items[] = {"PA Level", "Data Rate", "Dwell (ms)", "Strategy", "Burst Pkts", "Hop Order", "Save & Back"};
            String values[] = {
                paLabels[cfg.paLevel & 3],
                drLabels[cfg.dataRate <= 2 ? cfg.dataRate : 1],
                String(cfg.dwellTimeMs),
                stratLabels[cfg.strategy <= 2 ? cfg.strategy : 0],
                String(cfg.burstCount),
                hopLabels[cfg.randomHop & 1],
                ""
            };

            for (int i = 0; i < ITEM_COUNT; i++) {
                int itemY = y + i * lineH;
                uint16_t fg = (i == menuIdx) ? bruceConfig.bgColor : bruceConfig.priColor;
                uint16_t bg = (i == menuIdx) ? bruceConfig.priColor : bruceConfig.bgColor;

                tft.fillRect(7, itemY, tftWidth - 14, lineH - 2, bg);
                tft.setTextColor(fg, bg);
                String line = String(items[i]);
                if (values[i].length() > 0) { line += ": " + values[i]; }
                tft.drawString(line, 12, itemY + 2, 1);

                if (editing && i == menuIdx && i < ITEM_COUNT - 1) {
                    tft.setTextColor(TFT_YELLOW, bg);
                    tft.drawRightString("<>", tftWidth - 12, itemY + 2, 1);
                }
            }
            redraw = false;
        }

        if (check(NextPress)) {
            if (editing) {
                switch (menuIdx) {
                    case 0: cfg.paLevel = (cfg.paLevel + 1) % 4; break;
                    case 1: cfg.dataRate = (cfg.dataRate + 1) % 3; break;
                    case 2: cfg.dwellTimeMs = min(200, (int)cfg.dwellTimeMs + 1); break;
                    case 3: cfg.strategy = (cfg.strategy + 1) % 3; break;
                    case 4: cfg.burstCount = min((uint8_t)20, (uint8_t)(cfg.burstCount + 1)); break;
                    case 5: cfg.randomHop = !cfg.randomHop; break;
                }
            } else {
                menuIdx = (menuIdx + 1) % ITEM_COUNT;
            }
            redraw = true;
        }

        if (check(PrevPress)) {
            if (editing) {
                switch (menuIdx) {
                    case 0: cfg.paLevel = (cfg.paLevel + 3) % 4; break;
                    case 1: cfg.dataRate = (cfg.dataRate + 2) % 3; break;
                    case 2: cfg.dwellTimeMs = max(0, (int)cfg.dwellTimeMs - 1); break;
                    case 3: cfg.strategy = (cfg.strategy + 2) % 3; break;
                    case 4: cfg.burstCount = max((uint8_t)1, (uint8_t)(cfg.burstCount - 1)); break;
                    case 5: cfg.randomHop = !cfg.randomHop; break;
                }
            } else {
                menuIdx = (menuIdx + ITEM_COUNT - 1) % ITEM_COUNT;
            }
            redraw = true;
        }

        if (check(SelPress)) {
            if (menuIdx == ITEM_COUNT - 1) {
                saveJamConfigs();
                break;
            }
            editing = !editing;
            redraw = true;
        }

        delay(50);
    }
}

// ══════════════════════════════════════════════════════════════════
// ═══════════════ JAMMER STATUS UI ═════════════════════════════
// ══════════════════════════════════════════════════════════════════

static void drawJammerStatus(NrfJamMode mode, int currentCh, uint8_t nrfOnline, bool initial,
                             unsigned long elapsedMs = 0, unsigned long totalCh = 0, unsigned long sweeps = 0) {
    const NrfJamConfig &cfg = jamConfigs[(uint8_t)mode];
    const char *paLabels[] = {"MIN", "LOW", "HIGH", "MAX"};
    const char *drLabels[] = {"1M", "2M", "250K"};
    const char *stratNames[] = {"CW", "FLOOD", "TURBO"};

    if (initial) { drawMainBorderWithTitle("NRF JAMMER"); }

