Seph-esp/ESP32DIV-v2-Bruce/src/modules/NRF24/nrf_jammer.cpp
    int y = BORDER_PAD_Y + FM * LH + 4;
    int lineH = max(14, tftHeight / 10);
    char buf[48];

    tft.setTextSize(FP);

    // Line 1: Mode name + Strategy badge
    tft.fillRect(7, y, tftWidth - 14, lineH, bruceConfig.bgColor);
    tft.setTextColor(TFT_GREEN, bruceConfig.bgColor);
    tft.drawString(MODE_INFO[(uint8_t)mode].name, 12, y + 2, 1);
    const char *strat = stratNames[cfg.strategy <= 2 ? cfg.strategy : 0];
    uint16_t badgeClr = (cfg.strategy == 2) ? TFT_RED : (cfg.strategy == 1) ? TFT_ORANGE : TFT_CYAN;
    int bw = strlen(strat) * 6 + 8;
    int bx = tftWidth - 12 - bw;
    tft.fillRoundRect(bx, y + 1, bw, lineH - 3, 3, badgeClr);
    tft.setTextColor(TFT_BLACK, badgeClr);
    tft.drawCentreString(strat, bx + bw / 2, y + 2, 1);
    y += lineH;

    // Line 2: Timer + Speed + Sweeps
    tft.fillRect(7, y, tftWidth - 14, lineH, bruceConfig.bgColor);
    unsigned long secs = elapsedMs / 1000;
    unsigned long mins = secs / 60;
    secs %= 60;
    unsigned long chPerSec = (elapsedMs > 500) ? (totalCh * 1000UL / elapsedMs) : 0;
    tft.setTextColor(TFT_WHITE, bruceConfig.bgColor);
    snprintf(buf, sizeof(buf), "%02lu:%02lu", mins, secs);
    tft.drawString(buf, 12, y + 2, 1);
    tft.setTextColor(TFT_CYAN, bruceConfig.bgColor);
    snprintf(buf, sizeof(buf), "%lu ch/s  S:%lu", chPerSec, sweeps);
    tft.drawRightString(buf, tftWidth - 12, y + 2, 1);
    y += lineH;

    // Line 3: Channel + Frequency + Radios + Hop mode
    tft.fillRect(7, y, tftWidth - 14, lineH, bruceConfig.bgColor);
    int freq = 2400 + currentCh;
    tft.setTextColor(TFT_YELLOW, bruceConfig.bgColor);
    snprintf(buf, sizeof(buf), "CH:%d %dMHz x%d%s", currentCh, freq, nrfOnline,
             cfg.randomHop ? " RND" : "");
    tft.drawCentreString(buf, tftWidth / 2, y + 2, 1);
    y += lineH;

    // Line 4: 2.4GHz Band visualization strip
    {
        int sX = 12, sW = tftWidth - 24;
        int sH = max(6, lineH - 4);
        int sY = y + (lineH - sH) / 2;
        tft.fillRect(sX, sY, sW, sH, TFT_DARKGREY);
        size_t chCount = 0;
        const uint8_t *chList = getChannelList(mode, chCount);
        if (mode == NRF_JAM_FULL || mode == NRF_JAM_DRONE) {
            for (int c = 0; c < 125; c++) {
                int px = sX + (c * sW) / 125;
                int pw = max(1, sX + ((c + 1) * sW) / 125 - px);
                uint16_t col = (c > 83) ? TFT_RED : (c > 42) ? TFT_YELLOW : TFT_GREEN;
                tft.fillRect(px, sY + 1, pw, sH - 2, col);
            }
        } else if (chCount > 0 && chList) {
            for (size_t ci = 0; ci < chCount; ci++) {
                int c = chList[ci];
                if (c >= 125) continue;
                int px = sX + (c * sW) / 125;
                int pw = max(1, sX + ((c + 1) * sW) / 125 - px);
                tft.fillRect(px, sY + 1, pw, sH - 2, TFT_GREEN);
            }
        }
        if (currentCh < 125) {
            int mx = sX + (currentCh * sW) / 125;
            tft.fillRect(mx, sY, 2, sH, TFT_WHITE);
        }
        tft.drawRect(sX, sY, sW, sH, bruceConfig.priColor);
    }
    y += lineH;

    // Line 5: Config summary
    tft.fillRect(7, y, tftWidth - 14, lineH, bruceConfig.bgColor);
    tft.setTextColor(TFT_DARKGREY, bruceConfig.bgColor);
    snprintf(buf, sizeof(buf), "PA:%s %s B:%d %s",
             paLabels[cfg.paLevel & 3],
             drLabels[cfg.dataRate <= 2 ? cfg.dataRate : 1],
             cfg.burstCount,
             cfg.randomHop ? "RND" : "SEQ");
    tft.drawCentreString(buf, tftWidth / 2, y + 2, 1);

    // Footer
    int footerY = tftHeight - BORDER_PAD_X - FP * LH - 2;
    tft.fillRect(7, footerY, tftWidth - 14, FP * LH, bruceConfig.bgColor);
    tft.setTextColor(TFT_DARKGREY, bruceConfig.bgColor);
    tft.drawCentreString("[ESC]Stop [<>]Mode [OK]Cfg", tftWidth / 2, footerY, 1);
}

// ══════════════════════════════════════════════════════════════════
// ═══════════════ JAMMER EXECUTION LOOP ════════════════════════
// ══════════════════════════════════════════════════════════════════

static void runJammer(NRF24_MODE nrfMode, NrfJamMode jamMode) {
    int OnX = 0;
    uint8_t NRFOnline = 1;
    uint8_t NRFSPI = 0;
    NrfJamMode currentMode = jamMode;
    int channel = 0;
    int hopIndex = 0;
    unsigned long jamStartMs = millis();
    unsigned long totalCh = 0;
    unsigned long sweepCount = 0;
    unsigned long lastDrawMs = 0;

    // Shuffled channel buffer for random hop
    uint8_t shuffledCh[128];
    size_t shuffledCount = 0;

    auto prepareChannels = [&](NrfJamMode m) {
        size_t count = 0;
        const uint8_t *chList = getChannelList(m, count);
        NrfJamConfig &c = jamConfigs[(uint8_t)m];
        if (m == NRF_JAM_FULL || m == NRF_JAM_DRONE) {
            shuffledCount = 125;
            for (int i = 0; i < 125; i++) shuffledCh[i] = i;
        } else if (count > 0 && chList) {
            shuffledCount = count;
            memcpy(shuffledCh, chList, count);
        } else {
            shuffledCount = 0;
        }
        if (c.randomHop && shuffledCount > 1) {
            shuffleChannels(shuffledCh, shuffledCount);
        }
    };

    prepareChannels(currentMode);

    if (CHECK_NRF_SPI(nrfMode)) {
        NrfJamConfig &cfg = jamConfigs[(uint8_t)currentMode];
        bool flooding = (cfg.strategy >= 1);

        if (flooding) {
            applyJamConfig(cfg, true);
        } else {
            initCW(channel);
        }
        NRFSPI = 1;
    }

    drawJammerStatus(currentMode, channel, NRFOnline, true, 0, 0, 0);

    if (CHECK_NRF_UART(nrfMode) || CHECK_NRF_BOTH(nrfMode)) {
        NRFSerial.println("RADIOS");
        vTaskDelay(50 / portTICK_PERIOD_MS);
    }

    bool running = true;
    bool redraw = false;

    while (running) {
        // ── Check for exit ──────────────────────────────────────
        if (check(EscPress)) {
            running = false;
            break;
        }

        // ── UART handling ───────────────────────────────────────
        if (CHECK_NRF_UART(nrfMode) || CHECK_NRF_BOTH(nrfMode)) {
            if (OnX == 0) {
                NRFSerial.println("RADIOS");
                vTaskDelay(250 / portTICK_PERIOD_MS);
            }
            if (NRFSerial.available()) {
                String incomingNRFs = NRFSerial.readStringUntil('\n');
                incomingNRFs.trim();
                if (incomingNRFs.length() == 1 && isDigit(incomingNRFs.charAt(0))) {
                    OnX = 1;
                    NRFOnline = incomingNRFs.toInt();
                    if (CHECK_NRF_BOTH(nrfMode)) NRFOnline += NRFSPI;
                    redraw = true;
                }
            }
        }

        // ── Config: press SEL to edit mode config ───────────────
        if (check(SelPress)) {
            if (CHECK_NRF_SPI(nrfMode)) {
                if (nrf1_online) NRFradio.stopConstCarrier();
                if (nrf2_online) NRFradio2.stopConstCarrier();
                if (nrf3_online) NRFradio3.stopConstCarrier();
            }
            editModeConfig(currentMode);

            // Re-apply config after edit
            if (CHECK_NRF_SPI(nrfMode)) {
                NrfJamConfig &cfg = jamConfigs[(uint8_t)currentMode];
                if (cfg.strategy >= 1) {
                    applyJamConfig(cfg, true);
                } else {
                    initCW(channel);
                }
            }
            prepareChannels(currentMode);
            hopIndex = 0;
            redraw = true;
        }

        // ── Mode cycling: Next/Prev ─────────────────────────────
        if (check(NextPress)) {
            NrfJamMode prevMode = currentMode;
            currentMode = (NrfJamMode)(((uint8_t)currentMode + 1) % NRF_JAM_MODE_COUNT);
            hopIndex = 0;
            prepareChannels(currentMode);
            if (CHECK_NRF_SPI(nrfMode)) {
                NrfJamConfig &prevCfg = jamConfigs[(uint8_t)prevMode];
                NrfJamConfig &cfg = jamConfigs[(uint8_t)currentMode];
                bool prevFlood = (prevCfg.strategy >= 1);
                bool nowFlood = (cfg.strategy >= 1);
                if (prevFlood != nowFlood) {
                    if (nrf1_online) NRFradio.stopConstCarrier();
                    if (nrf2_online) NRFradio2.stopConstCarrier();
                    if (nrf3_online) NRFradio3.stopConstCarrier();
                    if (nowFlood) {
                        applyJamConfig(cfg, true);
                    } else {
                        initCW(channel);
                    }
                }
            }
            if (CHECK_NRF_UART(nrfMode) || CHECK_NRF_BOTH(nrfMode)) {
                NRFSerial.println(MODE_INFO[(uint8_t)currentMode].shortName);
            }
            redraw = true;
        }
        if (check(PrevPress)) {
            NrfJamMode prevMode = currentMode;
            currentMode = (NrfJamMode)(((uint8_t)currentMode + NRF_JAM_MODE_COUNT - 1) % NRF_JAM_MODE_COUNT);
            hopIndex = 0;
            prepareChannels(currentMode);
            if (CHECK_NRF_SPI(nrfMode)) {
                NrfJamConfig &prevCfg = jamConfigs[(uint8_t)prevMode];
                NrfJamConfig &cfg = jamConfigs[(uint8_t)currentMode];
                bool prevFlood = (prevCfg.strategy >= 1);
                bool nowFlood = (cfg.strategy >= 1);
                if (prevFlood != nowFlood) {
                    if (nrf1_online) NRFradio.stopConstCarrier();
                    if (nrf2_online) NRFradio2.stopConstCarrier();
                    if (nrf3_online) NRFradio3.stopConstCarrier();
                    if (nowFlood) {
                        applyJamConfig(cfg, true);
                    } else {
                        initCW(channel);
                    }
                }
            }
            redraw = true;
        }

        // ── Periodic display update (every 200ms) ────────────
        {
            unsigned long nowMs = millis();
            if (nowMs - lastDrawMs >= 200 || redraw) {
                // Sum online module counts
                int totalOnline = 0;
                if (nrf1_online) totalOnline++;
                if (nrf2_online) totalOnline++;
                if (nrf3_online) totalOnline++;
                drawJammerStatus(currentMode, channel, totalOnline, true, nowMs - jamStartMs, totalCh, sweepCount);
                lastDrawMs = nowMs;
                redraw = false;
            }
        }

        // ── Jamming logic (SPI mode) ────────────────────────────
        if (!CHECK_NRF_SPI(nrfMode)) {
            delay(10);
            continue;
        }

