Seph-esp/ESP32DIV-v2-Bruce/src/modules/NRF24/nrf_jammer.cpp
                        tft.fillRect(7, contentY, tftWidth - 14, lineHop, bruceConfig.bgColor);
                        tft.setTextColor(TFT_YELLOW, bruceConfig.bgColor);
                        int freq = 2400 + ch;
                        snprintf(hBuf, sizeof(hBuf), "CH: %d  (%d MHz)", ch, freq);
                        tft.drawCentreString(hBuf, tftWidth / 2, contentY, 1);

                        int footerY = tftHeight - BORDER_PAD_X - FP * LH - 2;
                        tft.fillRect(7, footerY, tftWidth - 14, FP * LH, bruceConfig.bgColor);
                        tft.setTextColor(TFT_DARKGREY, bruceConfig.bgColor);
                        tft.drawCentreString("[ESC] Stop", tftWidth / 2, footerY, 1);

                        hopRedraw = false;
                    }

                    if (CHECK_NRF_SPI(nrfMode)) { cwChannel(ch, 0); }

                    ch += hopCfg.stepSize;
                    if (ch > hopCfg.stopChannel) {
                        ch = hopCfg.startChannel;
                        hopRedraw = true; // Update display on wrap
                    }
                }

                if (CHECK_NRF_SPI(nrfMode)) {
                    NRFradio.stopConstCarrier();
                    NRFradio.powerDown();
                }
                if (CHECK_NRF_UART(nrfMode) || CHECK_NRF_BOTH(nrfMode)) { NRFSerial.println("OFF"); }
                return;
            } else if (menuIndex == 4) {
                return;
            } else {
                editMode = !editMode;
            }
            redraw = true;
            vTaskDelay(100 / portTICK_PERIOD_MS);
        }

        delay(50);
    }
}
